app/controllers/photos_controller.rb

INSERT INTO "photos" ("photo_url", "created_at", "updated_at") VALUES (?, ?, ?)  [["photo_url", "Thinkpiece_B.docx"], ["created_at", "2015-05-03 01:51:09.883028"], ["updated_at", "2015-05-03 01:51:09.883028"]]
---
  def create
  	@photo = Photo.create(photo_params)